; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	instrument11 - instrument
	thermograph2 - mode
	spectrograph3 - mode
	spectrograph1 - mode
	thermograph4 - mode
	thermograph0 - mode
	Star6 - direction
	GroundStation2 - direction
	GroundStation0 - direction
	GroundStation5 - direction
	GroundStation1 - direction
	Star4 - direction
	GroundStation3 - direction
	GroundStation7 - direction
	Star8 - direction
	Star9 - direction
	Planet10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Phenomenon14 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 spectrograph3)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 thermograph4)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 Star6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star9)
	(supports instrument3 thermograph4)
	(supports instrument3 spectrograph3)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation0)
	(calibration_target instrument3 GroundStation7)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet10)
	(supports instrument4 thermograph2)
	(supports instrument4 spectrograph3)
	(supports instrument4 thermograph4)
	(calibration_target instrument4 GroundStation1)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 GroundStation5)
	(calibration_target instrument5 GroundStation2)
	(supports instrument6 spectrograph3)
	(supports instrument6 thermograph2)
	(supports instrument6 spectrograph1)
	(calibration_target instrument6 GroundStation1)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation7)
	(supports instrument7 thermograph2)
	(supports instrument7 spectrograph1)
	(supports instrument7 thermograph4)
	(calibration_target instrument7 Star4)
	(calibration_target instrument7 GroundStation7)
	(supports instrument8 spectrograph3)
	(supports instrument8 thermograph4)
	(supports instrument8 spectrograph1)
	(calibration_target instrument8 GroundStation1)
	(calibration_target instrument8 GroundStation0)
	(supports instrument9 spectrograph3)
	(calibration_target instrument9 GroundStation7)
	(calibration_target instrument9 GroundStation5)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star4)
	(supports instrument10 spectrograph1)
	(supports instrument10 thermograph0)
	(supports instrument10 thermograph4)
	(calibration_target instrument10 Star4)
	(calibration_target instrument10 GroundStation1)
	(supports instrument11 spectrograph3)
	(calibration_target instrument11 GroundStation7)
	(calibration_target instrument11 GroundStation3)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet10)
)
(:goal (and
	(pointing satellite0 Phenomenon14)
	(pointing satellite1 GroundStation5)
	(pointing satellite3 GroundStation7)
	(pointing satellite4 GroundStation5)
	(have_image Star8 spectrograph1)
	(have_image Star9 spectrograph3)
	(have_image Planet10 spectrograph3)
	(have_image Planet11 spectrograph1)
	(have_image Phenomenon12 thermograph4)
	(have_image Planet13 thermograph4)
	(have_image Phenomenon14 thermograph0)
))

)

; plan
1. (turn_to satellite4 groundstation5 planet10)
   deleted: (pointing satellite4 planet10)
   added: (pointing satellite4 groundstation5)
   goals met: 1 of 11
2. (turn_to satellite3 groundstation0 star4)
   deleted: (pointing satellite3 star4)
   added: (pointing satellite3 groundstation0)
   goals met: 1 of 11
3. (switch_on instrument8 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument8)
   goals met: 1 of 11
4. (calibrate satellite3 instrument8 groundstation0)
   added: (calibrated instrument8)
   goals met: 1 of 11
5. (turn_to satellite3 planet11 groundstation0)
   deleted: (pointing satellite3 groundstation0)
   added: (pointing satellite3 planet11)
   goals met: 1 of 11
6. (take_image satellite3 planet11 instrument8 spectrograph1)
   added: (have_image planet11 spectrograph1)
   goals met: 2 of 11
7. (turn_to satellite3 planet10 planet11)
   deleted: (pointing satellite3 planet11)
   added: (pointing satellite3 planet10)
   goals met: 2 of 11
8. (take_image satellite3 planet10 instrument8 spectrograph3)
   added: (have_image planet10 spectrograph3)
   goals met: 3 of 11
9. (turn_to satellite3 phenomenon12 planet10)
   deleted: (pointing satellite3 planet10)
   added: (pointing satellite3 phenomenon12)
   goals met: 3 of 11
10. (turn_to satellite1 groundstation5 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 groundstation5)
   goals met: 4 of 11
11. (turn_to satellite0 star6 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star6)
   goals met: 4 of 11
12. (take_image satellite3 phenomenon12 instrument8 thermograph4)
   added: (have_image phenomenon12 thermograph4)
   goals met: 5 of 11
13. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 5 of 11
14. (calibrate satellite0 instrument2 star6)
   added: (calibrated instrument2)
   goals met: 5 of 11
15. (turn_to satellite0 phenomenon14 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 phenomenon14)
   goals met: 6 of 11
16. (take_image satellite0 phenomenon14 instrument2 thermograph0)
   added: (have_image phenomenon14 thermograph0)
   goals met: 7 of 11
17. (turn_to satellite3 planet13 phenomenon12)
   deleted: (pointing satellite3 phenomenon12)
   added: (pointing satellite3 planet13)
   goals met: 7 of 11
18. (take_image satellite3 planet13 instrument8 thermograph4)
   added: (have_image planet13 thermograph4)
   goals met: 8 of 11
19. (turn_to satellite3 star8 planet13)
   deleted: (pointing satellite3 planet13)
   added: (pointing satellite3 star8)
   goals met: 8 of 11
20. (take_image satellite3 star8 instrument8 spectrograph1)
   added: (have_image star8 spectrograph1)
   goals met: 9 of 11
21. (turn_to satellite3 star9 star8)
   deleted: (pointing satellite3 star8)
   added: (pointing satellite3 star9)
   goals met: 9 of 11
22. (take_image satellite3 star9 instrument8 spectrograph3)
   added: (have_image star9 spectrograph3)
   goals met: 10 of 11
23. (turn_to satellite3 groundstation7 star9)
   deleted: (pointing satellite3 star9)
   added: (pointing satellite3 groundstation7)
   goals met: 11 of 11
